const UaAboutApp = () => {
    return (
        <div className="mainContent" id="aapW">
            <div className="additionInfo">
                <h2>Про додаток</h2>
                <article>
                    Загалом це додаток, який містить візуальний інтерфейс. В цьому додатку
                    користувач має можливість вибору файлу з 24-розрядним малюнком BMP у форматі .bmp
                    (шляхом виклику системного діалогу), на
                    «подобу» якого (використовуючи заголовок та розміри) буде створено
                    файл у форматі .bmp, для кожної точки якого діятиме певна залежність
                    кольору від її координат (рахунок ведеться від лівого верхнього кута).
                    Для
                    збереження новоствореного файлу викликається відповідний
                    системний діалог.
                    Користувачеві надається вибір одного із
                    двох (скоро буде 3) принципово різних способів побудови бітової карти
                    новоствореного файлу та вибір із двох (скоро буде 3) кольорових комбінацій їх
                    реалізації.
                    При цьому, передбачена можливість продовження сеансу
                    роботи із обраним на початку файлом без потреби повторного виклику
                    діалогу відкриття. Водночас, у користувача є можливість на
                    будь-якому етапі роботи з програмою вибрати інший файл.
                </article>
                <br/>
                <article>
                    Забезпечення користувачів можливістю «непомітно» передати коротке
                    текстове повідомлення, вклавши його у BMP-файл з параметрами і
                    способом взаємодії аналогічними попередньому пункту.
                    Передача
                    повідомлення здійснюється наступним чином: кожен байт інформації
                    розкладається на 8 бітів і кожен з цих бітів записується молодшим бітом у
                    поточний байт кольорової карти BMP-файлу.У користувача є
                    можливість вкласти повідомлення у BMP-файл, але немає можливості отримати
                    повідомлення із BMP-файлу.
                </article>
                <br/>
                <article>
                    Цей додаток забезпечений процесами авторизації користувачів за іменем користувача та паролем.
                    Для авторизованих користувачів програма
                     «пам’ятає» 3 останні:
                    <ul>
                        <li>
                            BMP-файли, з якими велася будь-яка робота;
                        </li>
                        <li>
                            Режими створення нової бітової карти, які застосовував користувач;
                        </li>
                    </ul>
                    Ще не пам'ятає:
                    <ul>
                        <li>
                            Повідомлення, які були вкладені у BMP-файл;
                        </li>
                        <li>
                            Повідомлення, які були отримані з BMP-файлу.
                        </li>
                    </ul>

                </article>
                <br/>
                <article>
                    Після авторизації користувача, додаток ще не активовує останній
                    використаний користувачем режим роботи із останніми налаштуваннями,
                    які були використані. Зато користувач має можливість
                    завантажити один із трьох останніх режимів (файлів, повідомлень), про
                    які програма «пам’ятає»
                </article>
                <br/>
                <article>
                    У користувача ще не має можливості у будь-який момент деавторизуватися
                    зі збереженням поточних налаштувань роботи
                </article>
                <br/>
                <article>
                    Користувач має можливість викликати інформацію: «Інструкція користувача», «Про
                    програму» (власне ця сторінка) та «Про авторів»
                </article>
            </div>
        </div>
    )
}

export default UaAboutApp