const UaUserManual = () => {
    return (
        <div className="mainContent">
            <div className="additionInfo">
                <h2>
                    Як користуватись цим додатком
                </h2>
                <p>
                    В навігаційній панелі спочатку потрібно залогінитись, або зареєструватись.
                    Потім ви вибираєте будь яке зображення, але зауважте, це зображення має бути з розширенням bmp, щоб програма могла працювати з цим зображенням.
                    Дальше ви обираєте спосіб побудови бітової карти. Та за бажанням приховати повідомлення. В історії можете переглянути останні результати роботи бітових карт
                    та за бажанням завантажити один із результатів.
                </p>
            </div>
        </div>
        )
}

export default UaUserManual
